import styles from '../../css/messagecardCSS/message.module.css';
import Messagecard from  '../MessageCard/Messagecard'
import p from '../../assets/Images/p.jpg';
import m from '../../assets/Images/img.jpeg';
function Message(){
   
    return(
        <div className={styles.wrapper}>
            <Messagecard 
                messageimg={`${p}`}
                title={`${"Principal"}`}
                topcontent={`${"श्री विश्वनाथ इण्टर कॉलेज कलान, सुलतानपुर शिक्षा के लिए समर्पित मनीषी श्रीयुत भोलानाथ सिंह के सपनों का फल है जिसे उन्होंने अपनी कर्मठता से सजाया संवारा है,एक ज्ञान यज्ञ की शुरुआत की है। आज विद्यालय परिवार इस यज्ञ की पूर्णता के लिए प्रयत्नशील है। मेरी कोशिश है कि"}` }
                bottomcontent={`${" संस्थापक प्रधानाचार्य के आदर्शों एवं अपने पूर्ववर्ती प्रधानाचार्यों द्वारा स्थापित शैक्षणिक मानदंडों में आधुनिक व तकनीकी शैक्षणिक विधियों का समावेशन कर विद्यार्थियों को अद्यतन व आधुनिकतम स्तर की शिक्षा व शिक्षा सहगामी गतिविधियों के द्वारा पारंगत किया जाए, जिससे वह अपने, सामाजिक व राष्ट्रीय, दायित्वों की निर्वहन में कुशल राष्ट्रभक्त नागरिक के रूप में विकसित हो सके । विद्यालय प्रबंधन के उन्मुक्त सहयोग शिक्षक-शिक्षणेत्तर कर्मचारियों की निष्ठा व कर्तव्य-परायणता व विद्यार्थियों के अनुशासन-प्रिय अध्ययनशील प्रवृत्ति से मैं अपने उद्देश्य पूर्ति में पूर्ण सफल रहूंगा, इसका मुझे पूर्ण विश्वास है । ईश्वरीय कृपा के साथ मैं विद्यार्थियों के अभिभावकों का भी आभारी हूं जिनका विद्यालय की हर व्यवस्था में पूर्ण सहयोग प्राप्त होता रहता है | "}`}
                />            
                    
                       
            <Messagecard 
            messageimg={`${m}`}
            title={`${"Manager"}`}
            topcontent={`${"श्री विश्वनाथ इण्टर कॉलेज कलान सुलतानपुर की स्थापना 27 जून 1951 ई० को क्षेत्र के सुधीगण द्वारा जू०हा० के रूप में किया गया था | यह विद्यालय अपने शैक्षणिक उत्कर्ष की ओर उस समय अग्रसर हुआ जब श्री भोला नाथ सिंह, जुलाई 1974 ई. में अनुदानित श्रेणी के मा० शिक्षा के (रसायन विज्ञान) प्रवक्ता का पद, कलान गाँव के पूज्य पूर्वजों के जन आग्रह पर त्याग कर, इस वित्तविहीन विद्यालय के प्रधानाचार्य पद के दायित्व को आत्मार्पित कर लिए | संस्थापक प्रधानाचार्य जी , अपने"}` }
            bottomcontent={`${" कठिन परिश्रम, निष्ठा, ईमानदारी,उत्तमोत्तम ज्ञान व स्वभाव के प्रभाव में , इस विद्यालय को 1976 ई. में इंटरमीडिएट तक अनुदानित श्रेणी का विद्यालय स्थापित करने में पूर्ण सफल रहे | आपका यह कृत्य ही इस विद्यालय के लिए सदैव शिक्षा का आदर्श स्वरुप बन गया । आपके प्रधानाचार्य की यह सेवा राज्य की व्यवस्था के अनुपालन में 30 जून 2007 ई. को पूर्ण हो गयी | आप द्वारा शिक्षा क्षेत्र में उच्च शिक्षा व अन्य संस्थानों के माध्यम से शिक्षा की गुणवत्ता में जो मानक स्थापित किये गए, उनके प्रभाव में जनमानस आपको दूसरे मालवीय होने की उपाधि देता है। इस विद्यालय की संचालक सोसाइटी श्री आर्यावर्त माध्यमिक पाठशाला कलान, कादीपुर, सुलतानपुर की साधारण सभा के सम्मानित सदस्यगण द्वारा मुझे दिनांक 7 अगस्त 2005 को सर्वसम्मति से इस विदयालय के प्रबंधक पद का दायित्व, विद्यालय की प्रशासन योजना के अनुसार सौंपा गया । यह दायित्व मेरे लिए अनेक कठिनाईयों से पूर्ण था, किन्तु 1 जुलाई 2007 से उदय प्रकाश सिंह जी द्वारा इस विद्यालय के प्रधानाचार्य पद का दायित्व ग्रहण करने के बाद से इतने सरलता से क्रियान्वित हुआ कि विद्यालय प्रगति का मार्ग प्रशस्त होता चला गया । श्री सिंह ने अपनी कार्य कुशलता से जुलाई 1974 ई० की निरन्तरता को उच्चीकृत रखने में मुझको पूर्ण सहयोग दिया। आपकी यह सेवा 31 मार्च 2016 को पूर्ण हो गई। 1 अप्रैल 2016 को डॉ. शिव हर्ष सिंह ने प्रधानाचार्य पद का दायित्व निर्वहन करते हुए, विद्यालय की गरिमा को सह-शिक्षा के अन्तर्गत उत्तमोत्तम शिक्षा का संचालन करके 31 मार्च 2022 को सेवा पूर्ण की । अद्यतन डॉ आशुतोष सिंह द्वारा गरिमामय प्रधानाचार्य पद के दायित्व का निर्वहन सुचारू रूप से किया जा रहा है । वर्तमान में यह संस्थान के लगभग 7600 विद्यार्थियों के उत्तम शिक्षा, स्वास्थ्य,संस्कार व अन्य शैक्षणिक सहगामी क्रियाकलापों का केंद्र बिंदु बना हुआ है। इस विद्यालय की परम्परागत पहचान है किए यहां के आदर्श, विद्वान, समर्पित गुरुजन,शिक्षा के संयुक्त दायित्व के प्रभाव में निष्काम ढंग से शिक्षा व शिक्षणेत्तर कार्य से जुड़ी व्यवस्थाओं के क्रियान्वयन को फलीभूत करके, विद्यार्थियों का सम्पूर्ण विकास प्रभावशाली ढंग से सम्पन्न करते है। मैं प्रबंधक पद के सम्पूर्ण दायित्वों के इस 19 वर्षीय कार्य अवधि में यह अनुभूति करता हूँ कि उ.प्र. के ग्रामीण क्षेत्र में अनुदानित व वित्तविहीन शिक्षण संस्थाओं के शिक्षा व संस्कार का क्रियान्वयन यहां जैसा अथवा इससे उत्तम अन्यत्र कहीं हो तो मुझे अवगत कराया जाये । जिससे की इस विदयालय व्यवस्था में त्रुटि व जानकारी के अभाव में छूटे हुए उन मानकों व आदर्शों को मैं भी पूरा कर सकूँ। मेरे जीवन का हर पल शिक्षा के प्रत्येक क्षेत्र में उत्कृष्टतम परिणित हेतु जनहित में समर्पित। "}`}
            />            
                       
                   
       
        </div>
    )
}

export default Message;